In [1]:
print("hello pandas")

hello pandas

In [4]:
a = 1
for i in range(0,10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [2]:
import pandas as pd
import numpy as np

In [13]:
arr = np.array([1,2,3,4,5])
print(arr)

[1 2 3 4 5]

In [14]:
series_data = pd.Series(arr)
print(series_data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
type(series_data)

pandas.core.series.Series

In [19]:
x = pd.Series(arr,index=[100,101,102,103,104])
print(x)

100    1
101    2
102    3
103    4
104    5
dtype: int64

In [20]:
data = {'a': 1, 'b': 2, 'c': 3 ,'d': 4}
x = pd.Series(data)
print(x)

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
x = pd.Series(5, index=[0,1,2,3,4,5,6,7,8])
x

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
dtype: int64

In [29]:
data = [1,2,3,4,5]
x= pd.Series(data,index=[90,91,92,93,94])
x

90    1
91    2
92    3
93    4
94    5
dtype: int64

In [47]:
x[92]

3

In [48]:
x[[90,91,92]]

90    1
91    2
92    3
dtype: int64

In [49]:
#DataFrame
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
name = ['dheeraj','yash','naresh','himanshu','aryan','ajlal']
age =[19,19,21,21,18,20]
data = {'Name':name ,'Age':age}
df = pd.DataFrame(data)
df

       Name  Age
0   dheeraj   19
1      yash   19
2    naresh   21
3  himanshu   21
4     aryan   18
5     ajlal   20

In [6]:
import pandas as pd
import numpy as np

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [13]:
data = np.array([10,15,5,60,79,90,89,90,95,100,67,29,78])
df= pd.DataFrame(data=data,index=[0,1,2,3,4,5,6,7,8,9,10,11,12],columns=['marks'])
print(df[df['marks']>60])

    marks
4      79
5      90
6      89
7      90
8      95
9     100
10     67
12     78

In [9]:
import pandas as pd
data = {
    'Age':[1,10,14,50,8,43,34,7,1,23]
}
df = pd.DataFrame(data)
df[df['Age']<30]
df['Name']=['Dheeraj','Aryan','Ajlal','Yash','Shashank','Anuja','Tanya','Abhishek','Nikita','Mansi']
df=df['Age'].unique()
print(df)

[ 1 10 14 50  8 43 34  7 23]

In [1]:
import pandas as pd
import numpy as np

In [2]:
newarr = np.arange(1,101)
s1 = pd.Series(newarr)
s1[1:4]

1    2
2    3
3    4
dtype: int64

In [3]:
# last 5 elements
s1[-5:]

95     96
96     97
97     98
98     99
99    100
dtype: int64

In [4]:
s1[[9,19,24]]

9     10
19    20
24    25
dtype: int64

In [5]:
s1.values

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [8]:
Name = ['Dheeraj','Aryan','Ajlal','Yash','Shashank']
Age = [19,19,20,19,21]
data = {'Name':Name,'Age':Age}
df = pd.DataFrame(data,index=[1,2,3,4,5])
df

       Name  Age
1   Dheeraj   19
2     Aryan   19
3     Ajlal   20
4      Yash   19
5  Shashank   21

In [1]:
df["Roll No"] = [11,13,56,8,3]
df['city'] = ['Mathura','Firozabad','Bhasti','Mathura','Mathura']
df['Blood-group'] = ['AB+','B+','O+','B+','B+']
df

NameError: name 'df' is not defined

In [23]:
df.drop('Blood-group',axis=1,inplace=True)
df

       Name  Age  Roll No       city
1   Dheeraj   19       11    Mathura
2     Aryan   19       13  Firozabad
3     Ajlal   20       56     Bhasti
4      Yash   19        8    Mathura
5  Shashank   21        3    Mathura

In [24]:
df.pop('city')
df

       Name  Age  Roll No
1   Dheeraj   19       11
2     Aryan   19       13
3     Ajlal   20       56
4      Yash   19        8
5  Shashank   21        3

In [32]:
df.shape

(5, 3)

In [5]:
import pandas as pd
import numpy as np

In [44]:
random = np.random.randint(1,100,20)
name = np.random.choice(['Dheeraj','Aryan','Ajlal','Yash','Shashank'],20)
choice = np.random.choice([10,11,12,13,14,15,16,17,18,19,20],20)

d1 = {"Random":random,"Name":name,"Choice":choice}
df = pd.DataFrame(d1)
df

    Random      Name  Choice
0       90   Dheeraj      16
1       41   Dheeraj      17
2       58  Shashank      18
3       16   Dheeraj      19
4       83   Dheeraj      10
5       26   Dheeraj      20
6       43      Yash      15
7       71   Dheeraj      13
8       62     Aryan      14
9       79  Shashank      18
10      20  Shashank      16
11      22  Shashank      20
12      85      Yash      14
13      52     Aryan      15
14      33  Shashank      13
15      54     Ajlal      11
16       7   Dheeraj      17
17      36  Shashank      11
18      53  Shashank      19
19      95   Dheeraj      20

In [7]:
df.shape

(20, 3)

In [8]:
df.head(10)

   Random      Name  Choice
0      98     Ajlal      20
1      99   Dheeraj      14
2      80     Aryan      14
3      50  Shashank      13
4      30     Aryan      19
5      81  Shashank      18
6      97  Shashank      17
7      15     Ajlal      12
8      72   Dheeraj      16
9      23      Yash      20

In [9]:
df.tail(10)

    Random      Name  Choice
10      38      Yash      20
11      28     Ajlal      19
12      15      Yash      15
13      61   Dheeraj      19
14      30     Aryan      17
15      18   Dheeraj      19
16      39     Aryan      11
17      63   Dheeraj      19
18      79     Aryan      19
19      51  Shashank      14

In [10]:
df.sample(10)

    Random      Name  Choice
16      39     Aryan      11
19      51  Shashank      14
0       98     Ajlal      20
18      79     Aryan      19
14      30     Aryan      17
9       23      Yash      20
8       72   Dheeraj      16
11      28     Ajlal      19
6       97  Shashank      17
4       30     Aryan      19

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Random  20 non-null     int64
 1   Name    20 non-null     object
 2   Choice  20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 612.0+ bytes

In [12]:
df.describe()

          Random     Choice
count  20.000000  20.000000
mean   53.350000  16.750000
std    28.945093   2.899637
min    15.000000  11.000000
25%    29.500000  14.000000
50%    50.500000  17.500000
75%    79.250000  19.000000
max    99.000000  20.000000

In [13]:
#type of a column
df.Random.dtype

dtype('int64')

In [14]:
import os 
os.getcwd()

'/Users/dheerajsingh/Developer/DSML'

In [15]:
pd.read_csv("./train.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
df.set_index('Random',inplace=True)

In [31]:
df

            Name  Choice
Random
81          Yash      18
35         Aryan      18
1           Yash      18
80      Shashank      15
76       Dheeraj      14
8          Ajlal      20
93       Dheeraj      19
2        Dheeraj      11
58         Ajlal      12
77      Shashank      19
29         Ajlal      18
67         Ajlal      17
37      Shashank      20
60      Shashank      14
1        Dheeraj      19
10         Aryan      10
3          Aryan      11
54          Yash      20
65      Shashank      12
63         Ajlal      15

In [33]:
df.sort_index()

            Name  Choice
Random
1           Yash      18
1        Dheeraj      19
2        Dheeraj      11
3          Aryan      11
8          Ajlal      20
10         Aryan      10
29         Ajlal      18
35         Aryan      18
37      Shashank      20
54          Yash      20
58         Ajlal      12
60      Shashank      14
63         Ajlal      15
65      Shashank      12
67         Ajlal      17
76       Dheeraj      14
77      Shashank      19
80      Shashank      15
81          Yash      18
93       Dheeraj      19

In [34]:
df.sort_index(ascending=False)

            Name  Choice
Random
93       Dheeraj      19
81          Yash      18
80      Shashank      15
77      Shashank      19
76       Dheeraj      14
67         Ajlal      17
65      Shashank      12
63         Ajlal      15
60      Shashank      14
58         Ajlal      12
54          Yash      20
37      Shashank      20
35         Aryan      18
29         Ajlal      18
10         Aryan      10
8          Ajlal      20
3          Aryan      11
2        Dheeraj      11
1        Dheeraj      19
1           Yash      18

In [35]:
df.sort_values(by='Choice')

            Name  Choice
Random
10         Aryan      10
3          Aryan      11
2        Dheeraj      11
58         Ajlal      12
65      Shashank      12
76       Dheeraj      14
60      Shashank      14
63         Ajlal      15
80      Shashank      15
67         Ajlal      17
81          Yash      18
1           Yash      18
35         Aryan      18
29         Ajlal      18
93       Dheeraj      19
1        Dheeraj      19
77      Shashank      19
37      Shashank      20
8          Ajlal      20
54          Yash      20

In [37]:
df

            Name  Choice
Random
81          Yash      18
35         Aryan      18
1           Yash      18
80      Shashank      15
76       Dheeraj      14
8          Ajlal      20
93       Dheeraj      19
2        Dheeraj      11
58         Ajlal      12
77      Shashank      19
29         Ajlal      18
67         Ajlal      17
37      Shashank      20
60      Shashank      14
1        Dheeraj      19
10         Aryan      10
3          Aryan      11
54          Yash      20
65      Shashank      12
63         Ajlal      15

In [39]:
df.iloc[5,1]

20

In [40]:
df.iloc[3]

Name      Shashank
Choice          15
Name: 80, dtype: object

In [42]:
df2 = pd.read_csv("./train.csv")

In [45]:
df2.iloc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [46]:
df2.set_index('Name').loc['Allen, Mr. William Henry']

PassengerId         5
Survived            0
Pclass              3
Sex              male
Age              35.0
SibSp               0
Parch               0
Ticket         373450
Fare             8.05
Cabin             NaN
Embarked            S
Name: Allen, Mr. William Henry, dtype: object

In [48]:
df3 = {
    'letter':['a','b','c','d','e'],
    'number':[1,2,3,4,5]
}
df3 = pd.DataFrame(df3)
df3

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4
4      e       5

In [49]:
df4 ={
    'letter':['f','g','h','i','j'],
    'number':[6,7,8,9,10]
}
df4 = pd.DataFrame(df4)
df4

  letter  number
0      f       6
1      g       7
2      h       8
3      i       9
4      j      10

In [56]:
pd.concat([df3,df4],axis=0)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4
4      e       5
0      f       6
1      g       7
2      h       8
3      i       9
4      j      10

In [57]:
pd.concat([df3,df4],axis=0,ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4
4      e       5
5      f       6
6      g       7
7      h       8
8      i       9
9      j      10

In [54]:
pd.concat([df3,df4],axis=1)

  letter  number letter  number
0      a       1      f       6
1      b       2      g       7
2      c       3      h       8
3      d       4      i       9
4      e       5      j      10

In [6]:
# for encyption purpose a web browser company wnats to generate random values which have mean equal to 0 and standard deviation equal to 1. They want 5 randomly generated values. Help them to generate numbers in 2 differnet trials.
import numpy as np
import pandas as pd
df = pd.DataFrame((0+1)*(np.random.randn(5,2)),columns=['trail1','trail2'])
df

     trail1    trail2
0  0.828780 -1.209679
1 -2.929089 -0.451621
2 -0.936053  0.333804
3 -0.591391 -0.343246
4 -2.321791 -1.413451

In [7]:
data = pd.read_csv('./batter.csv')
data

             batter  runs        avg  strike_rate
0           V Kohli  6634  36.251366   125.977972
1          S Dhawan  6244  34.882682   122.840842
2         DA Warner  5883  41.429577   136.401577
3         RG Sharma  5881  30.314433   126.964594
4          SK Raina  5536  32.374269   132.535312
..              ...   ...        ...          ...
600         C Nanda     0   0.000000     0.000000
601      Akash Deep     0   0.000000     0.000000
602         S Ladda     0   0.000000     0.000000
603  V Pratap Singh     0   0.000000     0.000000
604    S Lamichhane     0   0.000000     0.000000

[605 rows x 4 columns]

In [9]:
type(data)

pandas.core.frame.DataFrame

In [17]:
data[(data['strike_rate']>200) & (data['avg']>10) ]

       batter  runs   avg  strike_rate
360  Umar Gul    39  13.0   205.263158

In [3]:
import numpy as np
import pandas as pd
df2 = pd.DataFrame({1:[1,2,np.nan],2:[2,np.nan,np.nan],3:[1,2,3],4:[np.nan,np.nan,np.nan]})
df2

     1    2  3   4
0  1.0  2.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [5]:
df2.dropna()

Empty DataFrame
Columns: [1, 2, 3, 4]
Index: []

In [4]:
df2.dropna(how='all' , axis=1) # axis = 1 means column wise

     1    2  3
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df2.dropna(thresh=2)

     1    2  3   4
0  1.0  2.0  1 NaN
1  2.0  NaN  2 NaN

In [16]:
df2.fillna(df2[1].mean())

     1    2  3    4
0  1.0  2.0  1  1.5
1  2.0  1.5  2  1.5
2  1.5  1.5  3  1.5

In [1]:

df2.iloc[1:3]

NameError: name 'df2' is not defined